# DoubleParameterValue Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
DoubleParameterValue Constructor
DoubleParameterValue Class See Also
---
Default constructor
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public DoubleParameterValue()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DoubleParameterValue()
```

# See Also
DoubleParameterValue Class
DoubleParameterValue Overload
Autodesk.Revit.DB Namespace